In [ ]:
import numpy as np
import pandas as pd
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure',figsize=(10,6))
np.set_printoptions(precision=4,supress=True)

In [ ]:
!cat examples/ex1.csv

In [ ]:
import pandas as pd
df=pd.read_csv('/content/sample_data/ex1.csv')

df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
pd.read_table('/content/sample_data/ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
!cat examples/ex2.csv

In [ ]:
pd.read_csv('/content/ex2.csv',header=None)
pd.read_csv('/content/ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
names=['a','b','c','d','message']
pd.read_csv('/content/ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [ ]:
!cat examples/csv_mindex.csv
parsed=pd.read_csv('/content/csv_mindex.csv',index_col=['key1','key2'])
parsed

cat: examples/csv_mindex.csv: No such file or directory

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [ ]:
list(open('/content/ex3.txt'))

['1,2,3,4,hello\n', '5,6,7,8,world\n', '9,10,11,12,foo']

In [ ]:
import pandas as pd
result=pd.read_table('/content/ex3.txt',sep='\s+')
result

    1,2,3,4,hello
0   5,6,7,8,world
1  9,10,11,12,foo

In [ ]:
!cat examples/ex4.csv
import pandas as pd
pd.read_csv('/content/ex4.csv',skiprows=[0,2,3])

cat: examples/ex4.csv: No such file or directory

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
!cat examples/ex5.csv
import pandas as pd
result=pd.read_csv('/content/ex5.csv')
result
pd.isnull(result)

cat: examples/ex5.csv: No such file or directory

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [ ]:
result=pd.read_csv('/content/ex5.csv',na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

**Reading Text Files in Pieces**

In [ ]:
pd.options.display.max_rows=10

In [ ]:
result=pd.read_csv('/content/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
8959  2.311896 -0.417070 -1.409599 -0.515821   L
8960 -0.479893 -0.650419  0.745152 -0.646038   E
8961  0.523331  0.787112  0.486066  1.093156   K
8962 -0.362559  0.598894 -1.843201  0.887292   G
8963 -0.096376 -1.012999 -0.657431 -0.573315   0

[8964 rows x 5 columns]

In [ ]:
pd.read_csv('/content/ex6.csv',nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [ ]:
chunker=pd.read_csv('/content/ex6.csv',chunksize=1000)
chunker

In [ ]:

chunker=pd.read_csv('/content/ex6.csv',chunksize=1000)
tot=pd.Series([])
for piece in chunker:
  tot=tot.add(piece['key'].value_counts(),fill_value=0)
  tot=tot.sort_values(ascending=False)
  tot[:10]

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  This is separate from the ipykernel package so we can avoid doing imports until

**Writing Data to Text Format**

In [ ]:
data=pd.read_csv('/content/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
data.to_csv('/content/ex5.csv')
data.to_csv

<bound method NDFrame.to_csv of   something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo>

In [ ]:
import sys
data.to_csv(sys.stdout,sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [ ]:
data.to_csv(sys.stdout,na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [ ]:
data.to_csv(sys.stdout,index=False,header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [ ]:
data.to_csv(sys.stdout,index=False,columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [ ]:
import numpy as np
dates=pd.date_range('1/1/2000',periods=7)
ts=pd.Series(np.arange(7),index=dates)
ts.to_csv('/content/tseries.csv')
dates
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int64

**working and delimited format**

In [ ]:
import csv
f=open('/content/ex7.csv')
reader=csv.reader(f)
f

In [ ]:
for line in reader:
  print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [ ]:
with open('/content/ex7.csv') as f:
  lines=list(csv.reader(f))
  lines

In [ ]:
header,values=lines[0],lines[1:]
header,values

(['a', 'b', 'c'], [['1', '2', '3'], ['1', '2', '3']])

In [ ]:
data_dict={h:v for h,v in zip (header,zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

**JSON Data**

In [ ]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [ ]:
import json
result=json.loads(obj)
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [ ]:
asjson=json.dumps(result)
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [ ]:
siblings=pd.DataFrame(result['siblings'], columns=['name','age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [ ]:
import json
data=pd.read_json('/content/examples 1.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
print(data.to_json())
print(data.to_json(orient='records'))

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}
[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

**XML and HTML:Web Scraping**

In [ ]:
tables=pd.read_html('/content/examples.html')
len(tables)
failures=tables[0]
failures.head()

                      Bank Name  ...       Updated Date
0                   Allied Bank  ...  November 17, 2016
1  The Woodbury Banking Company  ...  November 17, 2016
2        First CornerStone Bank  ...  September 6, 2016
3            Trust Company Bank  ...  September 6, 2016
4    North Milwaukee State Bank  ...      June 16, 2016

[5 rows x 7 columns]

In [ ]:
close_timestamps=pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

**parsing XML with lxml.objectify**

In [ ]:
from lxml import objectify
path='/content/Performance_MNR.xml'
parsed=objectify.parse(open(path))
root=parsed.getroot()
path
parsed
root

In [ ]:
data = []

skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [ ]:
import pandas as pd
perf = pd.DataFrame(data)
perf.head()
perf

              AGENCY_NAME  ... MONTHLY_ACTUAL
0    Metro-North Railroad  ...           96.9
1    Metro-North Railroad  ...             95
2    Metro-North Railroad  ...           96.9
3    Metro-North Railroad  ...           98.3
4    Metro-North Railroad  ...           95.8
..                    ...  ...            ...
643  Metro-North Railroad  ...
644  Metro-North Railroad  ...
645  Metro-North Railroad  ...
646  Metro-North Railroad  ...
647  Metro-North Railroad  ...

[648 rows x 12 columns]

In [ ]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [ ]:
root
root.get('href')
root.text

'Google'

**Binary Data Formats**

In [ ]:
frame=pd.read_csv('/content/ex1.csv')
frame
frame.to_pickle('/content/yahoo_price (1).pkl')
pd.read_pickle('/content/yahoo_price (1).pkl')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

**Using HDF5 Format**

In [ ]:
import numpy as np
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [ ]:
store['obj1']

           a
0  -0.601448
1   0.603755
2  -0.409704
3   0.543537
4  -0.815780
..       ...
95 -0.861778
96  0.742834
97  1.031036
98  0.835229
99  1.021479

[100 rows x 1 columns]

In [ ]:
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])
store.close()

In [ ]:
frame.to_hdf('mydata.h5', 'obj3', format='table')
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0 -0.601448
1  0.603755
2 -0.409704
3  0.543537
4 -0.815780

**Reading Microsoft Excel Files**

In [ ]:
xlsx=pd.read_excel('/content/sampledatainsurance.xlsx')
xlsx

    Unnamed: 0  Unnamed: 1                                         Unnamed: 2
0          NaN         NaN                                                NaN
1          NaN         NaN                                                NaN
2          NaN         NaN                                                NaN
3          NaN         NaN                                    Downloaded From
4          NaN         NaN                              Sample Data for Excel
5          NaN         NaN                                                NaN
6          NaN         NaN                                  Related tutorials
7          NaN         NaN                                 Named Excel Tables
8          NaN         NaN                                    Data Entry Tips
9          NaN         NaN                            More Excel Sample Files
10         NaN         NaN                                                NaN
11         NaN         NaN                                              Notes
12         NaN         NaN                 Fake data to use for Excel testing
13         NaN         NaN                                                NaN
14         NaN         NaN  Get weekly Excel tips, tutorials, videos, and ...
15         NaN         NaN                       Contextures Excel Newsletter

In [ ]:
pd.read_excel(xlsx,'')

In [ ]:
frame=pd.read_excel('/content/sampledatainsurance.xlsx')
frame

    Unnamed: 0  Unnamed: 1                                         Unnamed: 2
0          NaN         NaN                                                NaN
1          NaN         NaN                                                NaN
2          NaN         NaN                                                NaN
3          NaN         NaN                                    Downloaded From
4          NaN         NaN                              Sample Data for Excel
5          NaN         NaN                                                NaN
6          NaN         NaN                                  Related tutorials
7          NaN         NaN                                 Named Excel Tables
8          NaN         NaN                                    Data Entry Tips
9          NaN         NaN                            More Excel Sample Files
10         NaN         NaN                                                NaN
11         NaN         NaN                                              Notes
12         NaN         NaN                 Fake data to use for Excel testing
13         NaN         NaN                                                NaN
14         NaN         NaN  Get weekly Excel tips, tutorials, videos, and ...
15         NaN         NaN                       Contextures Excel Newsletter

In [ ]:
writer=pd.ExcelWriter('/content/sampledatainsurance.xlsx')
frame.to_excel('/content/sampledatainsurance.xlsx')

**Interacting with Web APIs**

In [ ]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [ ]:
data = resp.json()
data[0]['title']

'Avoid import warning when lzma is missing'

In [ ]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])
issues

    number  ... state
0    43461  ...  open
1    43460  ...  open
2    43459  ...  open
3    43457  ...  open
4    43456  ...  open
5    43455  ...  open
6    43454  ...  open
7    43452  ...  open
8    43449  ...  open
9    43448  ...  open
10   43447  ...  open
11   43445  ...  open
12   43442  ...  open
13   43441  ...  open
14   43440  ...  open
15   43439  ...  open
16   43437  ...  open
17   43436  ...  open
18   43435  ...  open
19   43432  ...  open
20   43430  ...  open
21   43429  ...  open
22   43428  ...  open
23   43427  ...  open
24   43424  ...  open
25   43423  ...  open
26   43419  ...  open
27   43418  ...  open
28   43417  ...  open
29   43416  ...  open

[30 rows x 4 columns]

**Interacting with Databases**

In [ ]:
import sqlite3
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata.sqlite')
con.execute(query)
con.commit()

In [ ]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [ ]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [ ]:
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [ ]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5